<a href="https://colab.research.google.com/github/RamilSI/codewars/blob/main/Tap_Code_Translation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd

In [4]:
columns = [1,2,3,4,5]
values = [['A','B','CK','D','E'], ['F','G','H','I','G'],['M','N','O','P','L'],['Q','R','S','T','U'],['V','W','X','Y','Z']]
index = [1,2,3,4,5]
df = pd.DataFrame(values, columns=columns, index=index)
df

   1  2   3  4  5
1  A  B  CK  D  E
2  F  G   H  I  G
3  M  N   O  P  L
4  Q  R   S  T  U
5  V  W   X  Y  Z

In [6]:
text = "breaks"
t = list(text.upper())[0]

In [ ]:
.... .... . . ... .... .... ...
.... .... . . ... ..... .... ...
.... .... . . ... ..... .... ...

In [59]:
def tap_code_translation(text):
  t1 = ('')
  import pandas as pd
  columns = [1,2,3,4,5]
  values = [['A','B','CK','D','E'], ['F','G','H','I','G'],['M','N','O','P','L'],['Q','R','S','T','U'],['V','W','X','Y','Z']]
  index = [1,2,3,4,5]
  df = pd.DataFrame(values, columns=columns, index=index)

  for k in list(text.upper()):
    for col in df:
        for i, row_value in df[col].iteritems():
            if df[col][i] == k or k in df[col][i]:
              t = '.'*i + ' '+'.'*col+' '
              t1 +=t
              print (t1)
  return (t1.rstrip(' '))

In [60]:
tap_code_translation(text)

. ..
. .. .... ..
. .. .... .. . .....
. .. .... .. . ..... . .
. .. .... .. . ..... . . . ...
. .. .... .. . ..... . . . ... .... ...

'. .. .... .. . ..... . . . ... .... ...'

In [25]:
df[df=='A'].isna()

       1     2     3     4     5
1  False  True  True  True  True
2   True  True  True  True  True
3   True  True  True  True  True
4   True  True  True  True  True
5   True  True  True  True  True

In [3]:
d = {
    'AtomicNumber': [1, 2, 3, 4, 5],
    'Element': ['Hydrogen', 'Helium', 'Lithium', 'Beryllium', 'Boron'],
    'Symbol': ['H', 'He', 'Li', 'Be', 'B'],
    'BoilingPoint': [20.28, 4.22, 1615.00, 2742.00, 4200.00],
}
df = pd.DataFrame(d)
df

   AtomicNumber    Element Symbol  BoilingPoint
0             1   Hydrogen      H         20.28
1             2     Helium     He          4.22
2             3    Lithium     Li       1615.00
3             4  Beryllium     Be       2742.00
4             5      Boron      B       4200.00

In [22]:
s = pd.Series([10, 20, 30, 40, 50], ['a', 'b', 'c', 'd', 'e'])
s['a']

10